                                        22 FEB Assignment

Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [145]:
import pandas as pd

In [14]:
s = (4, 8, 15, 16, 23, 42)
a = pd.Series(s)

In [15]:
type(a)

pandas.core.series.Series

In [16]:
print(a)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [17]:
var = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [18]:
type(var)

list

In [21]:
a1 = pd.Series(var)

In [22]:
type(a1)

pandas.core.series.Series

In [23]:
print(a1)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:
Then, print the DataFrame.

In [24]:
data = { 'Name' : ['Alice','Bob', 'Claire'],
         'Age' : [25, 30, 27],
         'Gender' : ['Female', 'Male', 'Female']}

In [25]:
type(data)

dict

In [26]:
df = pd.DataFrame(data)

In [27]:
type(df)

pandas.core.frame.DataFrame

In [28]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [29]:
df.set_index('Name')

        Age  Gender
Name
Alice    25  Female
Bob      30    Male
Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Pandas Data Frame : 

A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

In [71]:
data = { 'Name' : ['Alice','Bob', 'Claire'],
         'Age' : [25, 30, 27],
         'Gender' : ['Female', 'Male', 'Female']}

In [72]:
df = pd.DataFrame(data)

In [73]:

df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Pandas Series

it's 1 Dimensional

Data frame contain of multiple series

In [74]:
df['Name']

0     Alice
1       Bob
2    Claire
Name: Name, dtype: object

In [75]:
#Data frame contain of multiple series

type(df['Name'])

pandas.core.series.Series

In [76]:
list = [1 , 'Sovan', {'age' : 28} , [1,2,3]]

In [80]:
sr1 = pd.Series(list)
sr1

0              1
1          Sovan
2    {'age': 28}
3      [1, 2, 3]
dtype: object

1

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [81]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [90]:
#reset_index

df.reset_index
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [91]:
#set Index

df.set_index("Age")

       Name  Gender
Age
25    Alice  Female
30      Bob    Male
27   Claire  Female

In [92]:
#sum of Ages

df['Age'].sum()

82

In [93]:
#mean of Ages

df['Age'].mean()

27.333333333333332

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

all are value mutable

except series all are size mutable

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [135]:
Name = pd.Series(['Sovan', 'Kamlesh', 'Iniesta'], index = [1, 2, 3])
Name

1      Sovan
2    Kamlesh
3    Iniesta
dtype: object

In [139]:
age = pd.Series([25,15,5], index=[1,2,3])
age

1    25
2    15
3     5
dtype: int64

In [140]:
Gender = pd.Series(['M', 'M', 'F'], index=[1,2,3])
Gender

1    M
2    M
3    F
dtype: object

In [146]:
df3 = pd.concat([Name, age, Gender], axis = 1)

In [147]:
df4 = pd.DataFrame(df3)

In [148]:
df4

         0   1  2
1    Sovan  25  M
2  Kamlesh  15  M
3  Iniesta   5  F